SELECT 
    "Код пачки",
    "Значение" AS "Температура замера",
    
    -- x0: если замер отрицательный (вернулся NULL) - берем саму температуру замера
    COALESCE((SELECT MAX("Температура") FROM "Виртуальные поправки" WHERE "Температура" <= "Значение"), "Значение") AS x0,
    -- y0: если замер отрицательный - берем поправку от 0 градусов (0.5)
    COALESCE((SELECT "Поправка"         FROM "Виртуальные поправки" WHERE "Температура" <= "Значение" ORDER BY "Температура" DESC LIMIT 1), 0.5) AS y0,
    
    -- x1: если замер > 40 (вернулся NULL) - берем саму температуру замера
    COALESCE((SELECT MIN("Температура") FROM "Виртуальные поправки" WHERE "Температура" >= "Значение"), "Значение") AS x1,
    -- y1: если замер > 40 - берем поправку от максимальных 40 градусов (4.5)
    COALESCE((SELECT "Поправка"         FROM "Виртуальные поправки" WHERE "Температура" >= "Значение" ORDER BY "Температура" ASC LIMIT 1), 4.5) AS y1

FROM "Параметры"
WHERE "Код типа параметра" = 2;